dot_config/emacs/README.org
#+Title: GNU Emacs
#+Property: header-args:emacs-lisp :tangle yes :comments link

This document describes my GNU Emacs configuration. You may use =C-c C-v t= to tangle each section automatically, or optionally, evaluate the following code block:

#+begin_src emacs-lisp :tangle no :results none
  (org-babel-tangle)
#+end_src

* Early Initialization

#+begin_src emacs-lisp :tangle "early-init.el"
;; early-init.el --- -*- lexical-binding: t -*-

(setq package-enable-at-startup nil)

(setq inhibit-startup-echo-area-message (user-login-name)
      inhibit-startup-screen t)
(put 'inhibit-startup-echo-area-message 'saved-value t)
(setq initial-scratch-message nil)

;; https://github.com/doomemacs/doomemacs/blob/6a8c09f01288f1ed00a7cc2b7f5887e8f2b4be77/lisp/doom-start.el#L103
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)

(load-theme 'modus-operandi)
#+end_src

* Initialization

#+begin_src emacs-lisp :tangle "init.el"
  ;; init.el --- -*- lexical-binding: t -*-
#+end_src

* Packages
** Elpaca

#+begin_src emacs-lisp :tangle "init.el"
(defvar elpaca-installer-version 0.8)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                  ,@(when-let* ((depth (plist-get order :depth)))
                                                      (list (format "--depth=%d" depth) "--no-single-branch"))
                                                  ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                        "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
(elpaca leaf)
(elpaca leaf-keywords
  (leaf-keywords-init))
(elpaca leaf-tree)
(elpaca leaf-convert)
(elpaca-wait)
#+end_src

** Meow

#+begin_src emacs-lisp :tangle "init.el"
(leaf meow
      :doc "Yet another modal editing on Emacs / 猫态编辑"
      :url "https://github.com/meow-edit/meow"
      :elpaca t
      :require (meow-helpers
                 meow-cheatsheet)
      :global-minor-mode meow-global
      :init
      (defun dotemacs//meow-setup ()
        (with-eval-after-load 'meow-cheatsheet
                              (setq meow-cheatsheet-layout
                                    meow-cheatsheet-layout-colemak-dh))
        (meow-leader-define-key
          '("1" . meow-digit-argument)
          '("2" . meow-digit-argument)
          '("3" . meow-digit-argument)
          '("4" . meow-digit-argument)
          '("5" . meow-digit-argument)
          '("6" . meow-digit-argument)
          '("7" . meow-digit-argument)
          '("8" . meow-digit-argument)
          '("9" . meow-digit-argument)
          '("0" . meow-digit-argument)
          '("/" . meow-keypad-describe-key)
           '("?" . meow-cheatsheet))
        (meow-motion-overwrite-define-key
          '("<escape>" . ignore))
        (meow-normal-define-key
          '("0" . meow-expand-0)
          '("9" . meow-expand-9)
          '("8" . meow-expand-8)
          '("7" . meow-expand-7)
          '("6" . meow-expand-6)
          '("5" . meow-expand-5)
          '("4" . meow-expand-4)
          '("3" . meow-expand-3)
          '("2" . meow-expand-2)
          '("1" . meow-expand-1)
          '("-" . negative-argument)
          '(";" . meow-reverse)
          '("," . meow-inner-of-thing)
          '("." . meow-bounds-of-thing)
          '("<" . meow-beginning-of-thing)
          '(">" . meow-end-of-thing)
          '("a" . meow-append)
          '("A" . meow-open-below)
          '("b" . meow-back-word)
          '("B" . meow-back-symbol)
          '("c" . meow-change)
          '("d" . meow-delete)
          '("D" . meow-backward-delete)
          '("e" . meow-line)
          '("E" . meow-goto-line)
          '("f" . meow-find)
          '("g" . meow-cancel-selection)
          '("G" . meow-grab)
          '("h" . meow-left)
          '("H" . meow-left-expand)
          '("i" . meow-insert)
          '("I" . meow-open-above)
          '("j" . meow-join)
          '("k" . meow-kill)
          '("l" . meow-till)
          '("m" . meow-mark-word)
          '("M" . meow-mark-symbol)
          '("n" . meow-next)
          '("N" . meow-next-expand)
          '("o" . meow-block)
          '("O" . meow-to-block)
          '("p" . meow-prev)
          '("P" . meow-prev-expand)
          '("q" . meow-quit)
          '("Q" . meow-goto-line)
          '("r" . meow-replace)
          '("R" . meow-swap-grab)
          '("s" . meow-search)
          '("t" . meow-right)
          '("T" . meow-right-expand)
          '("u" . meow-undo)
          '("U" . meow-undo-in-selection)
          '("v" . meow-visit)
          '("w" . meow-next-word)
          '("W" . meow-next-symbol)
          '("x" . meow-save)
          '("X" . meow-sync-grab)
          '("y" . meow-yank)
          '("z" . meow-pop-selection)
          '("'" . repeat)
          '("<escape>" . ignore)))
      :config
      (dotemacs//meow-setup))
#+end_src

** Vertico

#+begin_src emacs-lisp :tangle "init.el" :noweb yes
(leaf *vertico
      :config
      <<vertico>>
      <<vertico-buffer>>
      <<vertico-directory>>
      <<vertico-flat>>
      <<vertico-grid>>
      <<vertico-indexed>>
      <<vertico-mouse>>
      <<vertico-multiform>>
      <<vertico-quick>>
      <<vertico-repeat>>
      <<vertico-reverse>>
      <<vertico-suspend>>
      <<vertico-unobtrusive>>)
#+end_src

#+name: vertico
#+begin_src emacs-lisp :tange no
(leaf vertico
      :doc "VERTical Interactive COmpletion"
      :url "https://github.com/minad/vertico"
      :elpaca t
      :global-minor-mode t)
#+end_src

*** Vertico Buffer

#+name: vertico-buffer
#+begin_src emacs-lisp :tangle no
(leaf vertico-buffer
      :doc "Display Vertico like a regular buffer."
      :url "https://github.com/minad/vertico/blob/main/extensions/vertico-buffer.el"
      :after vertico)
#+end_src

*** Vertico Directory

#+name: vertico-directory
#+begin_src emacs-lisp :tangle no
(leaf vertico-directory
      :doc "Commands for Ido-like directory navigation."
      :url "https://github.com/minad/vertico/blob/main/extensions/vertico-directory.el"
      :after vertico
      :bind (:vertico-map :package vertico
                          ("RET"   . vertico-directory-enter)
                          ("DEL"   . vertico-directory-delete-char)
                          ("M-DEL" . vertico-directory-delete-word)))
#+end_src

