dot_config/emacs/early-init.el
;; [[file:README.org::*Early Initialization][Early Initialization:1]]
;; early-init.el --- -*- lexical-binding: t -*-

(setq package-enable-at-startup nil)

(setq inhibit-startup-echo-area-message (user-login-name)
      inhibit-startup-screen t)
(put 'inhibit-startup-echo-area-message 'saved-value t)
(setq initial-scratch-message nil)

;; https://github.com/doomemacs/doomemacs/blob/6a8c09f01288f1ed00a7cc2b7f5887e8f2b4be77/lisp/doom-start.el#L103
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)

(load-theme 'modus-operandi)
;; Early Initialization:1 ends here
