dot_config/emacs/README.org
*** Vertico Flat

#+name: vertico-flat
#+begin_src emacs-lisp :tangle no
(leaf vertico-flat
      :doc "Enable a flat, horizontal display."
      :url "https://github.com/minad/vertico/blob/main/extensions/vertico-flat.el"
      :after vertico)
#+end_src

*** Vertico Grid

#+name: vertico-grid
#+begin_src emacs-lisp :tangle no
(leaf vertico-grid
      :doc "Enable a grid display."
      :url "https://github.com/minad/vertico/blob/main/extensions/vertico-grid.el"
      :after vertico)
#+end_src

*** Vertico Indexed

#+name: vertico-indexed
#+begin_src emacs-lisp :tangle no
(leaf vertico-indexed
      :doc "Select indexed candidates with prefix arguments."
      :url "https://github.com/minad/vertico/blob/main/extensions/vertico-indexed.el"
      :after vertico)
#+end_src

*** Vertico Mouse

#+name: vertico-mouse
#+begin_src emacs-lisp :tangle no
(leaf vertico-mouse
      :doc "Support mouse for scrolling and candidate selection."
      :url "https://github.com/minad/vertico/blob/main/extensions/vertico-mouse.el"
      :after vertico
      :hook
      (vertico-mode-hook . vertico-mouse-mode))
#+end_src

*** Vertico Multiform

#+name: vertico-multiform
#+begin_src emacs-lisp :tangle no
(leaf vertico-multiform
      :doc "Configure Vertico modes per command or completion category."
      :url "https://github.com/minad/vertico/blob/main/extensions/vertico-multiform.el"
      :after vertico)
#+end_src

*** Vertico Quick

#+name: vertico-quick
#+begin_src emacs-lisp :tangle no
(leaf vertico-quick
      :doc "Commands to select using Avy-style quick keys."
      :url "https://github.com/minad/vertico/blob/main/extensions/vertico-quick.el"
      :after vertico)
#+end_src

*** Vertico Repeat

#+name: vertico-repeat
#+begin_src emacs-lisp :tangle no
(leaf vertico-repeat
      :doc "Repeats the last completion session."
      :url "https://github.com/minad/vertico/blob/main/extensions/vertico-repeat.el"
      :after vertico)
#+end_src

*** Vertico Reverse

#+name: vertico-reverse
#+begin_src emacs-lisp :tangle no
(leaf vertico-reverse
      :doc "Reverse the display."
      :url "https://github.com/minad/vertico/blob/main/extensions/vertico-reverse.el"
      :after vertico)
#+end_src

*** Vertico Suspend

#+name: vertico-suspend
#+begin_src emacs-lisp :tangle no
(leaf vertico-suspend
      :doc "Suspends and restores the current session."
      :url "https://github.com/minad/vertico/blob/main/extensions/vertico-suspend.el"
      :after vertico)
#+end_src

*** Vertico Unobstrusive

#+name: vertico-unobstrusive
#+begin_src emacs-lisp :tangle no
(leaf vertico-unobtrusive
      :doc "Displays only the topmost candidate."
      :url "https://github.com/minad/vertico/blob/main/extensions/vertico-unobtrusive.el"
      :after vertico)
#+end_src

** Marginalia

#+begin_src emacs-lisp :tangle "init.el"
(leaf marginalia
      :doc "Marginalia in the minibuffer"
      :url "https://github.com/minad/marginalia"
      :elpaca t
      :global-minor-mode t)
#+end_src

** Consult

#+begin_src emacs-lisp :tangle "init.el"
(leaf consult
      :doc "consult.el - Consulting completing-read"
      :url "https://github.com/minad/consult"
      :elpaca t
      :disabled nil) ;; Consult is recommended. Learn about it later.
#+end_src

** Embark

#+begin_src emacs-lisp :tangle "init.el"
(leaf embark
      :doc "Emacs Mini-Buffer Actions Rooted in Keymaps"
      :url "https://github.com/oantolin/embark"
      :elpaca t
      :disabled t) ;; Embark is recommended. Learn about it later.
#+end_src

** Orderless

#+begin_src emacs-lisp :tangle "init.el"
(leaf orderless
      :doc "Emacs completion style that matches multiple regexps in any order."
      :url "https://github.com/oantolin/orderless"
      :elpaca t
      :custom ((completion-styles . '(orderless basic))
               (completion-category-defaults . nil)
               (completion-category-overrides '((file (styles partial-completion))))))
#+end_src

** Magit

#+begin_src emacs-lisp :tangle "init.el" :noweb yes
(leaf *magit
      :config
      <<magit>>
      <<delta>>
      <<forge>>
      ;; https://github.com/progfolio/elpaca/issues/272
      <<transient>>)
#+end_src

#+name: magit
#+begin_src emacs-lisp :tangle no
(leaf magit
      :doc "It's Magit! A Git porcelain inside Emacs."
      :url "https://github.com/magit/magit"
      :elpaca t)
#+end_src

*** Delta

#+name: delta
#+begin_src emacs-lisp :tangle no
(leaf magit-delta
      :doc "Use delta (https://github.com/dandavison/delta) when viewing diffs in Magit "
      :url "https://github.com/dandavison/magit-delta"
      :elpaca t
      :hook
      (magit-mode-hook . magit-delta-mode))
#+end_src

*** Forge

#+name: forge
#+begin_src emacs-lisp :tangle no
(leaf forge
      :doc "Work with Git forges from the comfort of Magit"
      :url "https://github.com/magit/forge"
      :elpaca t
      :setq (auth-sources '("~/.authinfo")))
#+end_src

*** Transient

#+name: transient
#+begin_src emacs-lisp :tangle no
(leaf transient
      :doc "Transient commands"
      :url "https://github.com/magit/transient"
      :elpaca t)
#+end_src

** Dimmer

#+begin_src emacs-lisp :tangle "init.el"
(leaf dimmer
      :doc "Interactively highlight which buffer is active by dimming the others."
      :url "https://github.com/gonewest818/dimmer.el"
      :elpaca t
      :global-minor-mode t
      :custom
      (dimmer-prevent-dimming-predicates . '(window-minibuffer-p))
      (dimmer-fraction . 0.5)
      (dimmer-adjustment-mode . :foreground)
      (dimmer-use-colorspace . :rgb)
      (dimmer-watch-frame-focus-events . nil) ; don't dim buffers when Emacs loses focus
      ((lambda ()
         "Exclude Vertico buffer from dimming."
         (with-no-warnings
           (add-to-list 'dimmer-buffer-exclusion-regexps "^ \\*Vertico\\*$")))))
#+end_src

** Org

#+begin_src emacs-lisp :tangle "init.el" :noweb yes
(leaf *org
      :config
      <<org>>
      <<org-modern>>)
#+end_src

#+name: org
#+begin_src emacs-lisp :tangle no
(leaf org
      :doc "Fast and effective plain text system."
      :url "https://orgmode.org/"
      :elpaca t
      :setq ((org-auto-align-tags                . nil)
             (org-tags-column                    . 0)
             (org-catch-invisible-edits          . 'show-and-error)
             (org-special-ctrl-a/e               . t)
             (org-insert-heading-respect-content . t)
             (org-hide-emphasis-markers          . t)
             (org-pretty-entities                . t)
             (org-ellipsis                       . "…")))
#+end_src

*** Modern Org Style

#+name: org-modern
#+begin_src emacs-lisp :tangle no
  (leaf org-modern
        :doc "Modern Org Style"
        :url "https://github.com/minad/org-modern"
        :elpaca t
        :hook
        (org-mode-hook . org-modern-mode))
#+end_src

** Clipboard

#+begin_src emacs-lisp :tangle "init.el"
(leaf xclip
      :elpaca t
      :global-minor-mode t)
#+end_src


* Language Server Protocol

Due to its inherent complexity, I treat Language Server Protocol (LSP) setup as its own distinct section, even though it still involves various packages.

#+begin_src emacs-lisp :tangle "init.el" :noweb yes
(leaf *language-server-protocol
      :config
      <<eglot>>
      <<clangd-inactive-region>>
      <<company>>)
#+end_src

** Eglot

#+name: eglot
#+begin_src emacs-lisp :tangle no
(leaf eglot
      :doc "a client for language server protocol servers"
      :url "https://github.com/joaotavora/eglot"
      :elpaca t
      :defvar eglot-server-programs
      :defer-config
      (add-to-list 'eglot-server-programs
                   '(c++-mode . ("clangd"
                                 "--all-scopes-completion=true"
                                 "--background-index-priority=normal"
                                 "--background-index=true"
                                 "--clang-tidy"
                                 "--completion-parse=always"
                                 "--completion-style=bundled"
                                 "--function-arg-placeholders=false"
                                 "--header-insertion=never"
                                 "--parse-forwarding-functions"
                                 "--pch-storage=memory"
                                 "--ranking-model=decision_forest")))
      :hook
      ((c++-mode-hook) . eglot-ensure))
#+end_src

** Extensions
