dot_config/emacs/init.el
      (leaf vertico-flat
            :doc "Enable a flat, horizontal display."
            :url "https://github.com/minad/vertico/blob/main/extensions/vertico-flat.el"
            :after vertico)
      (leaf vertico-grid
            :doc "Enable a grid display."
            :url "https://github.com/minad/vertico/blob/main/extensions/vertico-grid.el"
            :after vertico)
      (leaf vertico-indexed
            :doc "Select indexed candidates with prefix arguments."
            :url "https://github.com/minad/vertico/blob/main/extensions/vertico-indexed.el"
            :after vertico)
      (leaf vertico-mouse
            :doc "Support mouse for scrolling and candidate selection."
            :url "https://github.com/minad/vertico/blob/main/extensions/vertico-mouse.el"
            :after vertico
            :hook
            (vertico-mode-hook . vertico-mouse-mode))
      (leaf vertico-multiform
            :doc "Configure Vertico modes per command or completion category."
            :url "https://github.com/minad/vertico/blob/main/extensions/vertico-multiform.el"
            :after vertico)
      (leaf vertico-quick
            :doc "Commands to select using Avy-style quick keys."
            :url "https://github.com/minad/vertico/blob/main/extensions/vertico-quick.el"
            :after vertico)
      (leaf vertico-repeat
            :doc "Repeats the last completion session."
            :url "https://github.com/minad/vertico/blob/main/extensions/vertico-repeat.el"
            :after vertico)
      (leaf vertico-reverse
            :doc "Reverse the display."
            :url "https://github.com/minad/vertico/blob/main/extensions/vertico-reverse.el"
            :after vertico)
      (leaf vertico-suspend
            :doc "Suspends and restores the current session."
            :url "https://github.com/minad/vertico/blob/main/extensions/vertico-suspend.el"
            :after vertico)
      )
;; Vertico:1 ends here

;; [[file:README.org::*Marginalia][Marginalia:1]]
(leaf marginalia
      :doc "Marginalia in the minibuffer"
      :url "https://github.com/minad/marginalia"
      :elpaca t
      :global-minor-mode t)
;; Marginalia:1 ends here

;; [[file:README.org::*Consult][Consult:1]]
(leaf consult
      :doc "consult.el - Consulting completing-read"
      :url "https://github.com/minad/consult"
      :elpaca t
      :disabled nil) ;; Consult is recommended. Learn about it later.
;; Consult:1 ends here

;; [[file:README.org::*Embark][Embark:1]]
(leaf embark
      :doc "Emacs Mini-Buffer Actions Rooted in Keymaps"
      :url "https://github.com/oantolin/embark"
      :elpaca t
      :disabled t) ;; Embark is recommended. Learn about it later.
;; Embark:1 ends here

;; [[file:README.org::*Orderless][Orderless:1]]
(leaf orderless
      :doc "Emacs completion style that matches multiple regexps in any order."
      :url "https://github.com/oantolin/orderless"
      :elpaca t
      :custom ((completion-styles . '(orderless basic))
               (completion-category-defaults . nil)
               (completion-category-overrides '((file (styles partial-completion))))))
;; Orderless:1 ends here

;; [[file:README.org::*Magit][Magit:1]]
(leaf *magit
      :config
      (leaf magit
            :doc "It's Magit! A Git porcelain inside Emacs."
            :url "https://github.com/magit/magit"
            :elpaca t)
      (leaf magit-delta
            :doc "Use delta (https://github.com/dandavison/delta) when viewing diffs in Magit "
            :url "https://github.com/dandavison/magit-delta"
            :elpaca t
            :hook
            (magit-mode-hook . magit-delta-mode))
      (leaf forge
            :doc "Work with Git forges from the comfort of Magit"
            :url "https://github.com/magit/forge"
            :elpaca t
            :setq (auth-sources '("~/.authinfo")))
      ;; https://github.com/progfolio/elpaca/issues/272
      (leaf transient
            :doc "Transient commands"
            :url "https://github.com/magit/transient"
            :elpaca t))
;; Magit:1 ends here

;; [[file:README.org::*Dimmer][Dimmer:1]]
(leaf dimmer
      :doc "Interactively highlight which buffer is active by dimming the others."
      :url "https://github.com/gonewest818/dimmer.el"
      :elpaca t
      :global-minor-mode t
      :custom
      (dimmer-prevent-dimming-predicates . '(window-minibuffer-p))
      (dimmer-fraction . 0.5)
      (dimmer-adjustment-mode . :foreground)
      (dimmer-use-colorspace . :rgb)
      (dimmer-watch-frame-focus-events . nil) ; don't dim buffers when Emacs loses focus
      ((lambda ()
         "Exclude Vertico buffer from dimming."
         (with-no-warnings
           (add-to-list 'dimmer-buffer-exclusion-regexps "^ \\*Vertico\\*$")))))
;; Dimmer:1 ends here

;; [[file:README.org::*Org][Org:1]]
(leaf *org
      :config
      (leaf org
            :doc "Fast and effective plain text system."
            :url "https://orgmode.org/"
            :elpaca t
            :setq ((org-auto-align-tags                . nil)
                   (org-tags-column                    . 0)
                   (org-catch-invisible-edits          . 'show-and-error)
                   (org-special-ctrl-a/e               . t)
                   (org-insert-heading-respect-content . t)
                   (org-hide-emphasis-markers          . t)
                   (org-pretty-entities                . t)
                   (org-ellipsis                       . "…")))
      (leaf org-modern
            :doc "Modern Org Style"
            :url "https://github.com/minad/org-modern"
            :elpaca t
            :hook
            (org-mode-hook . org-modern-mode)))
;; Org:1 ends here

;; [[file:README.org::*Clipboard][Clipboard:1]]
(leaf xclip
      :elpaca t
      :global-minor-mode t)
;; Clipboard:1 ends here

;; [[file:README.org::*Language Server Protocol][Language Server Protocol:1]]
(leaf *language-server-protocol
      :config
      (leaf eglot
            :doc "a client for language server protocol servers"
            :url "https://github.com/joaotavora/eglot"
            :elpaca t
            :defvar eglot-server-programs
            :defer-config
            (add-to-list 'eglot-server-programs
                         '(c++-mode . ("clangd"
                                       "--all-scopes-completion=true"
                                       "--background-index-priority=normal"
                                       "--background-index=true"
                                       "--clang-tidy"
                                       "--completion-parse=always"
                                       "--completion-style=bundled"
                                       "--function-arg-placeholders=false"
                                       "--header-insertion=never"
                                       "--parse-forwarding-functions"
                                       "--pch-storage=memory"
                                       "--ranking-model=decision_forest")))
            :hook
            ((c++-mode-hook) . eglot-ensure))
      
      (leaf company
