dot_config/emacs/README.org
*** Clangd Inactive Regions

#+name: clangd-inactive-regions
#+begin_src emacs-lisp :tangle no
(leaf clangd-inactive-regions
      :doc "Emacs Eglot support for clangd inactiveRegions LSP extension."
      :url "https://github.com/fargiolas/clangd-inactive-regions.el"
      :elpaca (clangd-inactive-regions :host github :repo "fargiolas/clangd-inactive-regions.el")
      :setq  ((clangd-inactive-regions-set-method . "darken-foreground")
              (clangd-inactive-regions-set-opacity . 0.55))
      :init
      (require  'clangd-inactive-regions)
      (add-hook 'eglot-managed-mode-hook #'clangd-inactive-regions-mode))
#+end_src

** Company

#+name: Company
#+begin_src emacs-lisp :tangle no
(leaf company
      :doc "Modular text completion framework"
      :url "http://company-mode.github.io/"
      :elpaca t
      :leaf-defer nil
      :bind ((company-active-map
               ("[tab]"    . company-complete-selection)
               ("TAB"      . company-complete-selection)
               ("<return>" . nil)
               ("RET"      . nil)))
      :custom ((company-dabbrev-other-buffers . t)
               (company-format-margin-function . nil)
               (company-idle-delay . 0)
               (company-minimum-prefix-length . 1)
               (company-tooltip-align-annotations . t)
               (company-tooltip-limit . 8))
      :global-minor-mode global-company-mode)
#+end_src

* Built-in packages

Built-in packages come bundled with the default Emacs installation.

#+begin_src emacs-lisp :tangle "init.el" :noweb yes
(leaf *built-in
      :config
      <<savehist>>
      <<saveplace>>
      <<recentf>>
      <<autorevert>>
      <<winner>>
      <<cua>>
      <<contextmenu>>
      <<editorconfig>>
      <<xterm>>
      <<compilationshell>>)
#+end_src

** Save History

#+name: savehist
#+begin_src emacs-lisp :tangle no
(leaf savehist
      :doc "Save minibuffer history"
      :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/savehist.el"
      :global-minor-mode t)
#+end_src

** Save place

#+name: saveplace
#+begin_src emacs-lisp :tangle no
(leaf save-place
      :doc "Automatically save place in files"
      :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/saveplace.el"
      :global-minor-mode t)
#+end_src

** Recent files

#+name: recentf
#+begin_src emacs-lisp :tangle no
(leaf recentf
      :disabled t
      :doc "Keep track of recently opened files"
      :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/recentf.el"
      :global-minor-mode t)
#+end_src

** Auto revert

#+name: autorevert
#+begin_src emacs-lisp :tangle no
(leaf auto-revert
      :doc "Revert buffers when files on disk change "
      :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/autorevert.el"
      :global-minor-mode global-auto-revert)
#+end_src

** Winner

#+name: winner
#+begin_src emacs-lisp :tangle no
(leaf winner
      :doc "Restore old window configurations"
      :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/winner.el"
      :global-minor-mode t)
#+end_src

** Common User Access

#+name: cua
#+begin_src emacs-lisp :tangle no
(leaf cua
      :doc "CUA mode for copy-paste conventions"
      :url "https://www.gnu.org/software/emacs/manual/html_node/emacs/CUA-Bindings.html"
      :custom ((cua-keep-region-after-copy . t))
      :global-minor-mode t)
#+end_src

** Context menu

#+name: contextmenu
#+begin_src emacs-lisp :tangle no
(leaf context-menu
      :doc "Toggle context menu"
      :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/mouse.el"
      :global-minor-mode t)
#+end_src

** Editorconfig

#+name: editorconfig
#+begin_src emacs-lisp :tangle no
(leaf editorconfig
      :doc "EditorConfig support"
      :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/editorconfig-core.el"
      :global-minor-mode editorconfig-mode)
#+end_src

** XTerm

#+name: xterm
#+begin_src emacs-lisp :tangle no
(leaf xterm-mouse
      :doc "support the mouse when emacs run in an xterm"
      :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/xt-mouse.el"
      :global-minor-mode xterm-mouse
      :custom ((scroll-conservatively . 101)
               (scroll-margin . 4)
               (mouse-wheel-scroll-amount
                 . '(3 ((shift) . 5) ((control) . nil)))
               (mouse-wheel-progressive-speed . nil)))
#+end_src

** Compilation shell

#+name: compilationshell
#+begin_src emacs-lisp :tangle no
(leaf compilation-shell-minor
      :doc "Compilation shell minor mode"
      :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/progmodes/compile.el"
      :hook ((compilation-mode . compilation-shell-minor-mode)))
#+end_src

* Volatile

Things that are experimental in nature. They should be refactored or removed at some point.

** Operating System Command (OSC)

Modern terminals can send and receive Operating System Command (OSC) codes. In practice, this refers to the sequence of two ASCII characters: ~27~ and ~93 (ESC ])~. If the command takes ~parameters~, it will be followed by a semicolon, and the structure of the rest of the OSC sequence depends on the command. Well-behaved terminal emulators ignore OSC codes with unrecognized commands.

Continuing forward, the string terminator (ST) ends an OSC sequence and consists of either two ASCII characters: ~27~ and ~92 (ESC )~ or—now deprecated—ASCII ~7 (BEL)~. The ~parameters~ (Ps) consist of a single (usually optional) numeric parameter, which is composed of one or more decimal digits.

The XTerm specification states that the 10 colors listed below may be set or queried using codes ~10~ through ~19~. These are referred to as dynamic colors, as the corresponding control sequences were the first means for setting xterm's colors dynamically, i.e., after it was started. They are not the same as the ANSI colors; However, dynamic text foreground and background colors are used when ANSI colors are reset using SGR ~39~ and ~49~, respectively.

| Resource                 | Description                                |
|--------------------------+--------------------------------------------|
| Ps = 1 0                 |  Change VT100 text foreground color to Pt. |
| Ps = 1 1                 |  Change VT100 text background color to Pt. |
| Ps = 1 2                 |  Change text cursor color to Pt.           |
| Ps = 1 3                 |  Change pointer foreground color to Pt.    |
| Ps = 1 4                 |  Change pointer background color to Pt.    |
| Ps = 1 5                 |  Change Tektronix foreground color to Pt.  |
| Ps = 1 6                 |  Change Tektronix background color to Pt.  |
| Ps = 1 7                 |  Change highlight background color to Pt.  |
| Ps = 1 8                 |  Change Tektronix cursor color to Pt.      |
| Ps = 1 9                 |  Change highlight foreground color to Pt.  |

Here we advise [[elisp:(describe-symbol 'load-theme)][load-theme]] to send an ANSI escape sequence to update the background color according to the current frame's background-color parameter. Moreover, we advise Emacs to reset the terminal background to its default state upon exit.

https://invisible-island.net/xterm/ctlseqs/ctlseqs.html#h3-Operating-System-Commands

#+begin_src emacs-lisp :tangle "early-init.el"
  (defun dotemacs//xterm-change-text-background (&rest _args)
    (send-string-to-terminal
     (format "\e]11;%s\a" (frame-parameter nil 'background-color))))

  (advice-add #'load-theme :after #'dotemacs//xterm-change-text-background)
  (advice-add #'consult-theme :after #'dotemacs//xterm-change-text-background)

  (add-hook 'resume-tty-functions #'dotemacs//xterm-change-text-background)
  (dotemacs//xterm-change-text-background)
#+end_src

Dynamic colors can also be reset to their default.

| Resource                 | Description                        |
|--------------------------+------------------------------------|
| Ps = 1 1 0               | Reset VT100 text foreground color. |
| Ps = 1 1 1               | Reset VT100 text background color. |
| Ps = 1 1 2               | Reset text cursor color.           |
| Ps = 1 1 3               | Reset pointer foreground color.    |
| Ps = 1 1 4               | Reset pointer background color.    |
| Ps = 1 1 5               | Reset Tektronix foreground color.  |
| Ps = 1 1 6               | Reset Tektronix background color.  |
| Ps = 1 1 7               | Reset highlight color.             |
| Ps = 1 1 8               | Reset Tektronix cursor color.      |
| Ps = 1 1 9               | Reset highlight foreground color.  |

#+begin_src emacs-lisp :tangle "early-init.el"
  (defun dotemacs//xterm-reset-text-background (&rest _args)
    (send-string-to-terminal "\e]111;\a"))

  (add-hook 'kill-emacs-hook #'dotemacs//xterm-reset-text-background)
  (add-hook 'suspend-tty-functions #'dotemacs//xterm-reset-text-background)
#+end_src

If necessary, OSC compatibility can be tested as follows:

#+begin_src emacs-lisp :tangle no :results none
(defun dotemacs//xterm-parse-osc11 ()
  "Check if our Terminal supports OSC 11.
Sends an OSC 11 query and returns the response if the terminal supports it,
otherwise returns nil."
  (send-string-to-terminal "\e]11;?\e\\")
  (when (and (equal (read-event nil nil 2) ?\e)
             (equal (read-event nil nil 2) ?\]))
    (let ((response ""))
      (while (not (equal (setq chr (read-event nil nil 2)) ?\\))
             (setq response (concat response (string chr))))
      (when (string-match
              "11;rgb:\\([a-f0-9]+\\)/\\([a-f0-9]+\\)/\\([a-f0-9]+\\)" response)
        response))))
#+end_src
