dot_config/emacs/early-init.el

;; [[file:README.org::*Operating System Command (OSC)][Operating System Command (OSC):1]]
(defun dotemacs//xterm-change-text-background (&rest _args)
  (send-string-to-terminal
   (format "\e]11;%s\a" (frame-parameter nil 'background-color))))

(advice-add #'load-theme :after #'dotemacs//xterm-change-text-background)
(advice-add #'consult-theme :after #'dotemacs//xterm-change-text-background)

(add-hook 'resume-tty-functions #'dotemacs//xterm-change-text-background)
(dotemacs//xterm-change-text-background)
;; Operating System Command (OSC):1 ends here

;; [[file:README.org::*Operating System Command (OSC)][Operating System Command (OSC):2]]
(defun dotemacs//xterm-reset-text-background (&rest _args)
  (send-string-to-terminal "\e]111;\a"))

(add-hook 'kill-emacs-hook #'dotemacs//xterm-reset-text-background)
(add-hook 'suspend-tty-functions #'dotemacs//xterm-reset-text-background)
;; Operating System Command (OSC):2 ends here
