dot_config/emacs/init.el
            :doc "Modular text completion framework"
            :url "http://company-mode.github.io/"
            :elpaca t
            :leaf-defer nil
            :bind ((company-active-map
                     ("[tab]"    . company-complete-selection)
                     ("TAB"      . company-complete-selection)
                     ("<return>" . nil)
                     ("RET"      . nil)))
            :custom ((company-dabbrev-other-buffers . t)
                     (company-format-margin-function . nil)
                     (company-idle-delay . 0)
                     (company-minimum-prefix-length . 1)
                     (company-tooltip-align-annotations . t)
                     (company-tooltip-limit . 8))
            :global-minor-mode global-company-mode))
;; Language Server Protocol:1 ends here

;; [[file:README.org::*Built-in packages][Built-in packages:1]]
(leaf *built-in
      :config
      (leaf savehist
            :doc "Save minibuffer history"
            :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/savehist.el"
            :global-minor-mode t)
      (leaf save-place
            :doc "Automatically save place in files"
            :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/saveplace.el"
            :global-minor-mode t)
      (leaf recentf
            :disabled t
            :doc "Keep track of recently opened files"
            :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/recentf.el"
            :global-minor-mode t)
      (leaf auto-revert
            :doc "Revert buffers when files on disk change "
            :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/autorevert.el"
            :global-minor-mode global-auto-revert)
      (leaf winner
            :doc "Restore old window configurations"
            :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/winner.el"
            :global-minor-mode t)
      (leaf cua
            :doc "CUA mode for copy-paste conventions"
            :url "https://www.gnu.org/software/emacs/manual/html_node/emacs/CUA-Bindings.html"
            :custom ((cua-keep-region-after-copy . t))
            :global-minor-mode t)
      (leaf context-menu
            :doc "Toggle context menu"
            :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/mouse.el"
            :global-minor-mode t)
      (leaf editorconfig
            :doc "EditorConfig support"
            :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/editorconfig-core.el"
            :global-minor-mode editorconfig-mode)
      (leaf xterm-mouse
            :doc "support the mouse when emacs run in an xterm"
            :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/xt-mouse.el"
            :global-minor-mode xterm-mouse
            :custom ((scroll-conservatively . 101)
                     (scroll-margin . 4)
                     (mouse-wheel-scroll-amount
                       . '(3 ((shift) . 5) ((control) . nil)))
                     (mouse-wheel-progressive-speed . nil)))
      (leaf compilation-shell-minor
            :doc "Compilation shell minor mode"
            :url "https://github.com/emacs-mirror/emacs/blob/master/lisp/progmodes/compile.el"
            :hook ((compilation-mode . compilation-shell-minor-mode))))
;; Built-in packages:1 ends here
